tap "anomalyco/tap"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# High-performance authoritative-only DNS server
brew "knot"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"

cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Custom Discord client
cask "legcord"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Messaging app with a focus on speed and security
cask "telegram"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
